export default class DataService {
    data = [
        {
            id: 1,
            caseNumber: 123 / 45,
            judicialInstance: ["Перша", "Апеляційна", "Касаційна"],
            region: "Київська область",
            diocese: "Київська єпархія",
            nameJudge: "Іванов А.А.",
            adjudication: ["Вирок", "Окрема думка", "Окрема ухвала", "Постанова", "Рішення", "Судовий наказ", "Ухвала"],
            date: "13/05/20",
            legalProceedings: ["Адміністративна", "Адмінправопорушення", "Господарська", "Кримінальна", "Цивільна"],
            plaintiff: "Мурка К.К.", //позивач
            defendant: "Жучка С.С.",// відповідач
            comment: ""
        },
        {
            id: 2,
            caseNumber: 124 / 56,
            judicialInstance: ["Перша", "Апеляційна", "Касаційна"],
            region: "Чернігівська область",
            diocese: "Ніжинська єпархія",
            nameJudge: "Петров А.А.",
            adjudication: ["Вирок", "Окрема думка", "Окрема ухвала", "Постанова", "Рішення", "Судовий наказ", "Ухвала"],
            date: "21/07/19",
            legalProceedings: ["Адміністративна", "Адмінправопорушення", "Господарська", "Кримінальна", "Цивільна"],
            plaintiff: "Мишка М.М.", //позивач
            defendant: "Барсік К.К.",// відповідач
            comment: ""
        },
        {
            id: 3,
            caseNumber: 125 / 68,
            judicialInstance: ["Перша", "Апеляційна", "Касаційна"],
            region: "Херсонська область",
            diocese: "Херсонська єпархія",
            nameJudge: "Вовченко А.А.",
            adjudication: ["Вирок", "Окрема думка", "Окрема ухвала", "Постанова", "Рішення", "Судовий наказ", "Ухвала"],
            date: "1/09/20",
            legalProceedings: ["Адміністративна", "Адмінправопорушення", "Господарська", "Кримінальна", "Цивільна"],
            plaintiff: "Мурка К.К.", //позивач
            defendant: "Пушинка С.Т.",// відповідач
            comment: ""
        },
        {
            id: 1,
            caseNumber: 145 / 89,
            judicialInstance: ["Перша", "Апеляційна", "Касаційна"],
            region: "Полтавська область",
            diocese: "Полтавська єпархія",
            nameJudge: "Потапенко А.А.",
            adjudication: ["Вирок", "Окрема думка", "Окрема ухвала", "Постанова", "Рішення", "Судовий наказ", "Ухвала"],
            date: "13/04/18",
            legalProceedings: ["Адміністративна", "Адмінправопорушення", "Господарська", "Кримінальна", "Цивільна"],
            plaintiff: "Зорька К.К.", //позивач
            defendant: "Мурчик С.С.",// відповідач
            comment: ""
        },
        {
            id: 1,
            caseNumber: 248 / 33,
            judicialInstance: ["Перша", "Апеляційна", "Касаційна"],
            region: "Закарпатська область",
            diocese: "Закарпатська єпархія",
            nameJudge: "Іванов А.А.",
            adjudication: ["Вирок", "Окрема думка", "Окрема ухвала", "Постанова", "Рішення", "Судовий наказ", "Ухвала"],
            date: "13/05/20",
            legalProceedings: ["Адміністративна", "Адмінправопорушення", "Господарська", "Кримінальна", "Цивільна"],
            plaintiff: "Ведміть К.К.", //позивач
            defendant: "Вовк С.С.",// відповідач
            comment: ""
        }
    ];

    getData(){
        return this.data;
    }
}
